// Урок 2: 


// Урок 3: Управление доступом к членам класса

/* 1.   Создать класс «Двигатель автомобиля», включающий данные-элементы: 
 * марка автомобиля, 
 * объём топливного бака, 
 * расход бензина на 100 км. 
        Функции-элементы:
 * создание и инициализация (конструктор),
 * заправка автомобиля (количество бензина – в аргументе),
 * расход бензина (пройденный путь – в аргументе),
 * выдача сообщения о том, сколько км можно проехать на оставшемся бензине,
 * деструктор. 
 */

using oop_02;

//Console.Write("Марка авто: ");
//string marka = Console.ReadLine()!;

//Console.Write("Объём бака: ");
//double volume = double.Parse(Console.ReadLine());

//Console.Write("Расход / 100 км: ");
//double expend = double.Parse(Console.ReadLine());

//Console.Write("Топлива в баке: ");
//double current = double.Parse(Console.ReadLine());

//EngineOfCar auto = new EngineOfCar(marka, volume, current, expend);

//Console.WriteLine("Сколько залить топлива? ");
//double addFill = double.Parse(Console.ReadLine());
//auto.Feed(addFill);
//Console.WriteLine($"В баке: {auto.Current:F2}");
//Console.WriteLine("Расстояние: ");
//double km = double.Parse(Console.ReadLine());
//Console.WriteLine($"Расход: {auto.Way(km):F2} л");
//Console.WriteLine($"Проедешь: {auto.Remains():F2} км");



/* 2.   Создать класс «Склад пиломатериалов», включающий данные-элементы: 
 * номер склада, 
 * фамилия директора, 
 * максимальный объём хранимых пиломатериалов. 
        Функции-элементы:
 * создание и инициализация (конструктор),
 * ввезенные материалы, м3 (количество – в аргументе),
 * вывезенные материалы, м3 (в аргументе),
 * выдача сообщения, сколько можно еще завезти материалов и сколько есть в наличии,
 * деструктор.
 */

